{
  "architectures": [
    "NdmForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_ndm.NdmConfig",
    "AutoModelForCausalLM": "modeling_ndm.NdmForCausalLM"
  },
  "bos_token_id": 50256,
  "checkpoint_interval": 16,
  "checkpoint_loss": 2.6143,
  "checkpoint_step": 1524000,
  "d_conv": 4,
  "depth": 12,
  "dim": 1664,
  "e88_decay_mode": "mamba",
  "e88_value_residual": false,
  "eos_token_id": 50256,
  "expansion": 1.0,
  "gate_activation": "silu",
  "k_fast": null,
  "k_slow": null,
  "level": "E88",
  "linear_state": false,
  "local_validation_only": true,
  "loss_chunk_size": 0,
  "m2rnn_f_heads": null,
  "m2rnn_freeze_state_weight": false,
  "m2rnn_g_heads": null,
  "m2rnn_k_head_dim": null,
  "m2rnn_k_heads": null,
  "m2rnn_normalize_qk": false,
  "m2rnn_output_norm": false,
  "m2rnn_paper_shape": false,
  "m2rnn_q_heads": null,
  "m2rnn_state_grad_clip": null,
  "m2rnn_use_residual": true,
  "m2rnn_v_head_dim": null,
  "m2rnn_v_heads": null,
  "m2rnn_weight_heads": null,
  "model_identity": "Emender/E88",
  "model_type": "ndm",
  "n_groups": 32,
  "n_heads": 370,
  "n_slots": 64,
  "n_state": 32,
  "ndm_training_args_sanitized": {
    "bf16": true,
    "checkpoint_interval": 16,
    "chunk_size": 2048,
    "d_conv": 4,
    "depth": 12,
    "dim": 1664,
    "expansion": 1.0,
    "gate_activation": "silu",
    "k_fast": null,
    "k_slow": null,
    "level": "E88",
    "linear_state": false,
    "loss_chunk_size": 0,
    "m2rnn_f_heads": null,
    "m2rnn_g_heads": null,
    "m2rnn_k_head_dim": null,
    "m2rnn_k_heads": null,
    "m2rnn_normalize_qk": false,
    "m2rnn_output_norm": false,
    "m2rnn_paper_shape": false,
    "m2rnn_q_heads": null,
    "m2rnn_state_grad_clip": null,
    "m2rnn_v_head_dim": null,
    "m2rnn_v_heads": null,
    "m2rnn_weight_heads": null,
    "n_groups": 32,
    "n_heads": 370,
    "n_slots": 64,
    "n_state": 32,
    "params": "1270M",
    "projection_chunk_size": 0,
    "r_h_mode": "auto",
    "seed": 42,
    "state_expansion": 2,
    "tokenizer": "p50k_base",
    "top_k": null,
    "use_conv": false,
    "use_gate": true,
    "use_triton": true,
    "use_write_gate": false
  },
  "pad_token_id": 50256,
  "paper_endpoint_bpb": 0.973765,
  "paper_endpoint_step": 1523250,
  "private_staging": false,
  "projection_chunk_size": 0,
  "r_h_mode": "auto",
  "release_candidate": "v0.3-rc-local",
  "release_revision_name": "v0.3",
  "repo_id": "poietic-pbc/emender-e88-1.3b",
  "selected_step_delta_vs_paper": 750,
  "smoke_param_count": 1273191856,
  "source_checkpoint_path": "/tmp/pile_convergence_3arch/ctx2k/e88_postrepair_ckpt/levelE88_1270M_20260511_233832/checkpoint_step_1524000_loss_2.6143.pt",
  "source_checkpoint_sha256": "090c743f72cb4e28fbe9be05402d51a5353dd5fcfdc98c75628a537543f96c74",
  "state_expansion": 2,
  "tie_word_embeddings": true,
  "tokenizer_name": "p50k_base",
  "top_k": null,
  "torch_dtype": "bfloat16",
  "use_conv": false,
  "use_gate": true,
  "use_triton": true,
  "use_write_gate": false,
  "vocab_size": 50281,
  "num_hidden_layers": 12
}